Revit 2027 API
AreaTag.Area Property
The area that the tag is associated with.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Area Area { get; }
Public ReadOnly Property Area As Area
	Get
public:
property Area^ Area {
	Area^ get ();
}
member Area : Area with get
Property Value
Area
Remarks
In rare cases, the tag may not be associated to an area. The property will be null in these situations.
See Also
Reference
AreaTag Class
Autodesk.Revit.DB Namespace